In [2]:
import pandas as pd
import numpy as np

# Pandas Series

In [90]:
labels=['a','b','c','d']
myList = [1,2,3,4]
myDict={1:'a',2:'b',3:'c'}

In [91]:
pd.Series(data = myList)

0    1
1    2
2    3
3    4
dtype: int64

In [92]:
ser=pd.Series(data=myList,index=labels)
ser

a    1
b    2
c    3
d    4
dtype: int64

In [93]:
ser1=pd.Series(data = myDict)
ser1

1    a
2    b
3    c
dtype: object

In [94]:
ser[3]

4

In [95]:
ser['d']

4

# DataFrame

In [98]:
pd.DataFrame(data= np.random.randn(5,4))

          0         1         2         3
0 -0.128214  0.366284 -0.333203  0.288712
1 -0.548778  1.105654  0.174282 -0.710450
2  2.487719 -0.364659 -1.046076 -0.382139
3 -0.536274 -0.902778  0.433964 -0.664607
4  0.282693 -0.368493  0.507480 -0.324696

In [99]:
pd.DataFrame(data= np.random.randn(5,4),index=['a','b','c','d','e'])

          0         1         2         3
a  0.204797  0.911058  0.265892 -0.267922
b  0.544644  0.154454 -0.528778 -0.629703
c -0.451527  0.187821  2.454616 -1.363234
d -0.396217 -0.400031  1.353068  0.064433
e -0.498380  1.201989  1.070431  1.303440

In [101]:
df=pd.DataFrame(data= np.random.randn(5,4),index=['a','b','c','d','e'],columns=['w','r','z','x'])
df

          w         r         z         x
a  0.024180 -1.136131  0.718225  0.155659
b -0.516759  0.937919  0.968290  2.102474
c -1.888277  0.369769  0.786294  0.366949
d  0.844748 -0.158246 -0.051523  1.180683
e  0.612694 -0.793006  1.602031 -0.018214

In [103]:
df['x']

a    0.155659
b    2.102474
c    0.366949
d    1.180683
e   -0.018214
Name: x, dtype: float64

In [104]:
df['w']

a    0.024180
b   -0.516759
c   -1.888277
d    0.844748
e    0.612694
Name: w, dtype: float64

In [106]:
df[['w','z']]

          w         z
a  0.024180  0.718225
b -0.516759  0.968290
c -1.888277  0.786294
d  0.844748 -0.051523
e  0.612694  1.602031

In [107]:
df['new column']=df['w'] + df['z']

In [108]:
df

          w         r         z         x  new column
a  0.024180 -1.136131  0.718225  0.155659    0.742405
b -0.516759  0.937919  0.968290  2.102474    0.451531
c -1.888277  0.369769  0.786294  0.366949   -1.101984
d  0.844748 -0.158246 -0.051523  1.180683    0.793225
e  0.612694 -0.793006  1.602031 -0.018214    2.214724

In [116]:
df['new column']=[1,2,3,4,5]

In [114]:
df

          w         r         z         x  new column
a  0.024180 -1.136131  0.718225  0.155659           1
b -0.516759  0.937919  0.968290  2.102474           2
c -1.888277  0.369769  0.786294  0.366949           3
d  0.844748 -0.158246 -0.051523  1.180683           4
e  0.612694 -0.793006  1.602031 -0.018214           5

In [115]:
df.shape

(5, 5)

In [121]:
df.drop('new column',axis=1) # axis 1 checks columns,axis=0 checks rows

          w         r         z         x
a  0.024180 -1.136131  0.718225  0.155659
b -0.516759  0.937919  0.968290  2.102474
c -1.888277  0.369769  0.786294  0.366949
d  0.844748 -0.158246 -0.051523  1.180683
e  0.612694 -0.793006  1.602031 -0.018214

In [122]:
df # adding data  takes Inplace true as default

          w         r         z         x  new column
a  0.024180 -1.136131  0.718225  0.155659           1
b -0.516759  0.937919  0.968290  2.102474           2
c -1.888277  0.369769  0.786294  0.366949           3
d  0.844748 -0.158246 -0.051523  1.180683           4
e  0.612694 -0.793006  1.602031 -0.018214           5

In [123]:
df.drop('new column',axis=1,inplace=True)

In [124]:
df

          w         r         z         x
a  0.024180 -1.136131  0.718225  0.155659
b -0.516759  0.937919  0.968290  2.102474
c -1.888277  0.369769  0.786294  0.366949
d  0.844748 -0.158246 -0.051523  1.180683
e  0.612694 -0.793006  1.602031 -0.018214

In [126]:
df.loc['a'] # gives  all the value of given location

w    0.024180
r   -1.136131
z    0.718225
x    0.155659
Name: a, dtype: float64

In [127]:
df.iloc[0] # Gives all the value of given index i represents index

w    0.024180
r   -1.136131
z    0.718225
x    0.155659
Name: a, dtype: float64

In [128]:
df.loc['d']

w    0.844748
r   -0.158246
z   -0.051523
x    1.180683
Name: d, dtype: float64

In [129]:
df.loc[['a','b'],['w','z']]

          w         z
a  0.024180  0.718225
b -0.516759  0.968290

In [130]:
df['w']>0

a     True
b    False
c    False
d     True
e     True
Name: w, dtype: bool

In [131]:
df[df['w']>0] # Print those rows Which are true

          w         r         z         x
a  0.024180 -1.136131  0.718225  0.155659
d  0.844748 -0.158246 -0.051523  1.180683
e  0.612694 -0.793006  1.602031 -0.018214

In [132]:
df[df['w']>0]['x'] # Print The value of x only  wrt condition

a    0.155659
d    1.180683
e   -0.018214
Name: x, dtype: float64

In [133]:
df['new']=['A','B','C','D','E']
df

          w         r         z         x new
a  0.024180 -1.136131  0.718225  0.155659   A
b -0.516759  0.937919  0.968290  2.102474   B
c -1.888277  0.369769  0.786294  0.366949   C
d  0.844748 -0.158246 -0.051523  1.180683   D
e  0.612694 -0.793006  1.602031 -0.018214   E

In [134]:
df.set_index('new')   # It Doesn't affect the true df i.e shown in nxt cmmnd

            w         r         z         x
new
A    0.024180 -1.136131  0.718225  0.155659
B   -0.516759  0.937919  0.968290  2.102474
C   -1.888277  0.369769  0.786294  0.366949
D    0.844748 -0.158246 -0.051523  1.180683
E    0.612694 -0.793006  1.602031 -0.018214

In [137]:
df

          w         r         z         x new
a  0.024180 -1.136131  0.718225  0.155659   A
b -0.516759  0.937919  0.968290  2.102474   B
c -1.888277  0.369769  0.786294  0.366949   C
d  0.844748 -0.158246 -0.051523  1.180683   D
e  0.612694 -0.793006  1.602031 -0.018214   E

In [138]:
df.set_index('new',inplace=True) # Now It affect the original copy bcoz inplace is true

In [139]:
df

            w         r         z         x
new
A    0.024180 -1.136131  0.718225  0.155659
B   -0.516759  0.937919  0.968290  2.102474
C   -1.888277  0.369769  0.786294  0.366949
D    0.844748 -0.158246 -0.051523  1.180683
E    0.612694 -0.793006  1.602031 -0.018214

# Groupby

In [146]:
data = {'Employee_company':['Google','Google','Facebook','Facebook','Microsoft','Microsoft'],'Employee Id':['P1','P2','P3','P4','P5','P6'],'salary':[4500,6000,2300,5600,4660,8765]}

In [147]:
df=pd.DataFrame(data)
df

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765

In [148]:
df.sum()

Employee_company    GoogleGoogleFacebookFacebookMicrosoftMicrosoft
Employee Id                                           P1P2P3P4P5P6
salary                                                       31825
dtype: object

In [149]:
df.groupby('Employee_company').max()

                 Employee Id  salary
Employee_company
Facebook                  P4    5600
Google                    P2    6000
Microsoft                 P6    8765

In [150]:
df.groupby('Employee_company').sum()

                  salary
Employee_company
Facebook            7900
Google             10500
Microsoft          13425

In [151]:
df.groupby('Employee_company').min()

                 Employee Id  salary
Employee_company
Facebook                  P3    2300
Google                    P1    4500
Microsoft                 P5    4660

In [152]:
df.describe()

            salary
count     6.000000
mean   5304.166667
std    2127.708666
min    2300.000000
25%    4540.000000
50%    5130.000000
75%    5900.000000
max    8765.000000

In [153]:
df.groupby('Employee_company').describe()

                 salary                                                \
                  count    mean          std     min      25%     50%
Employee_company
Facebook            2.0  3950.0  2333.452378  2300.0  3125.00  3950.0
Google              2.0  5250.0  1060.660172  4500.0  4875.00  5250.0
Microsoft           2.0  6712.5  2902.673337  4660.0  5686.25  6712.5


                      75%     max
Employee_company
Facebook          4775.00  5600.0
Google            5625.00  6000.0
Microsoft         7738.75  8765.0

# concatenation

In [154]:
pd.concat([df,pd.DataFrame({'Employee_company':'TCS','Employee Id':'P7','salary':1100},index=[6]) ])# Row Concat

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765
6              TCS          P7    1100

In [160]:
df=pd.concat([df,pd.DataFrame([1,2,3,4,5,6],columns=['number'])],axis=1)
df# Column Wise Concat

  Employee_company Employee Id  salary  number  number
0           Google          P1    4500       1       1
1           Google          P2    6000       2       2
2         Facebook          P3    2300       3       3
3         Facebook          P4    5600       4       4
4        Microsoft          P5    4660       5       5
5        Microsoft          P6    8765       6       6

In [163]:
df.drop('number',axis=1,inplace=True)

In [164]:
df

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765

# Miscellaneous

In [165]:
df['Employee_company'].unique()

array(['Google', 'Facebook', 'Microsoft'], dtype=object)

In [40]:
df['Employee_company'].nunique()

3

In [166]:
df.groupby('Employee_company').count()

                  Employee Id  salary
Employee_company
Facebook                    2       2
Google                      2       2
Microsoft                   2       2

In [167]:
df['Employee_company'].count()

6

In [44]:
df['company'].value_counts()

Google       2
Facebook     2
Microsoft    2
Name: company, dtype: int64

In [45]:
def time2(value):
    return value*2

In [169]:
df['salary'].apply(time2)

0     9000
1    12000
2     4600
3    11200
4     9320
5    17530
Name: salary, dtype: int64

In [170]:
df['salary'].apply(lambda x:x*2)

0     9000
1    12000
2     4600
3    11200
4     9320
5    17530
Name: salary, dtype: int64

In [172]:
df['Employee_company'].apply(len)

0    6
1    6
2    8
3    8
4    9
5    9
Name: Employee_company, dtype: int64

In [173]:
df.apply(len)

Employee_company    6
Employee Id         6
salary              6
dtype: int64

In [174]:
df.sort_values('salary',ascending=False)

  Employee_company Employee Id  salary
5        Microsoft          P6    8765
1           Google          P2    6000
3         Facebook          P4    5600
4        Microsoft          P5    4660
0           Google          P1    4500
2         Facebook          P3    2300

In [175]:
df.drop(5)

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660

In [176]:
df.columns

Index(['Employee_company', 'Employee Id', 'salary'], dtype='object')

In [178]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [180]:
df

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765

# Read CSV

In [3]:
df1=pd.read_csv('data.csv')

In [4]:
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB